
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501706328764
  Licensed to: Miklós Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.

. do code/results.do 

. import excel "https://github.com/korenmiklos/r-python-stata/raw/main/Polls-pe
> r-user-CEU_R_Python_Stata_2022.xlsx", firstrow clear
(10 vars, 150 obs)

. * first line is metadata
. drop in 1
(1 observation deleted)

. 
. rename AreyouatCEUViennaoronline location

. rename AFTERDebateWhichcodingscr after

. rename StartWhichcodingscripting before 

. rename Whichwasthemostconvincingte team

. 
. keep location before after team

. 
. * drop "other" options
. drop if before == "Other" | after == "Other"
(4 observations deleted)

. * only keep those that mention these 3 languages at least once
. keep if inlist(before, "Stata", "R", "Python") | inlist(after, "Stata", "R", 
> "Python")
(14 observations deleted)

. 
. tabulate before after, missing

 [Start] Which coding |
 (scripting) language |   [AFTER Debate] Which coding (scripting)
     should a student |  language should a student (first) master
(first) master for Da |               Python          R      Stata |     Total
----------------------+--------------------------------------------+----------
                      |         0          6          3         17 |        26 
               Python |        14         14          1          2 |        31 
                    R |        14          6         13          2 |        35 
                Stata |        21          5          1         12 |        39 
----------------------+--------------------------------------------+----------
                Total |        49         31         18         33 |       131 

. 
. * Who said Stata is not a programming language?!
. foreach lang in Python R Stata {
  2.     generate byte switch_to_`lang' = (before != "`lang'" & after == "`lang
> '")
  3.     generate byte switch_from_`lang' = (before == "`lang'" & after != "`la
> ng'" & after != "dropped out")
  4.     generate difference_`lang' = switch_to_`lang' - switch_from_`lang'
  5.     label variable difference_`lang' "`lang'"
  6. }

. 
. graph dot (sum) difference_Python difference_Stata difference_R, scheme(econo
> mist) legend(order(3 "R" 2 "Stata" 1 "Python")) 

. graph export "img/results.png", width(1000) replace
file img/results.png written in PNG format

. 
end of do-file
